Revit 2027 API
ISaveSharedCoordinatesCallback.GetSaveModifiedLinksOption Method
 Determines whether Revit should save the link, not save the link, or discard shared positioning entirely.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
SaveModifiedLinksOptions GetSaveModifiedLinksOption(
	RevitLinkType link
)
Function GetSaveModifiedLinksOption (
	link As RevitLinkType
) As SaveModifiedLinksOptions
SaveModifiedLinksOptions GetSaveModifiedLinksOption(
	RevitLinkType^ link
)
abstract GetSaveModifiedLinksOption :
        link : RevitLinkType -> SaveModifiedLinksOptions
Parameters
link RevitLinkType
 The Revit link which has modified shared coordinates.
Return Value
SaveModifiedLinksOptions
 The options when saving a linked file which has been modified in-memory by shared coordinates operations.
See Also
Reference
ISaveSharedCoordinatesCallback Interface
Autodesk.Revit.DB Namespace